/*
 * 组件 - 会员注册协议Sheet
 * agreementSheet
 * -----------------------------------
 * 19/03/06 Jerry 新增
*/

var
helper = require('../../../utils/helper.js');

Component({
options: {
  addGlobalClass: true
},
/* ------------------------------
 组件的属性列表
------------------------------ */
properties: { }, /* properties */

/* ------------------------------
 组件的初始数据
------------------------------ */
data: { hidden: 'hidden' }, /* data */
/* ------------------------------
 组件的方法列表
------------------------------ */
methods: {

  /* ------------------------------
   显示协议
  ------------------------------ */
  showSheet(){
    this.setData({ hidden: '' });
  },
  /* ------------------------------
   关闭协议
  ------------------------------ */
  closeSheet(){
    this.setData({ hidden: 'hidden' });
  }

}

});
